Revit 2027 API
NumericRevisionSettings.StartNumber Property
 The start number for the sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int StartNumber { get; set; }
Public Property StartNumber As Integer
	Get
	Set
public:
property int StartNumber {
	int get ();
	void set (int value);
}
member StartNumber : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for number is negative.
See Also
Reference
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace